; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	image2 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
)
(:goal (and
	(pointing satellite0 Star12)
	(pointing satellite1 Planet14)
	(have_image Planet6 image2)
	(have_image Star7 thermograph0)
	(have_image Star8 image2)
	(have_image Phenomenon9 image2)
	(have_image Star10 spectrograph1)
	(have_image Star11 thermograph0)
	(have_image Star12 image2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (turn_to satellite1 planet14 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet14)
   goals met: 1 of 11
2. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 1 of 11
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 11
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 11
5. (turn_to satellite0 planet14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet14)
   goals met: 1 of 11
6. (take_image satellite0 planet14 instrument0 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 11
11. (turn_to satellite0 planet6 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet6)
   goals met: 4 of 11
12. (take_image satellite0 planet6 instrument0 image2)
   added: (have_image planet6 image2)
   goals met: 5 of 11
13. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 5 of 11
14. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 6 of 11
15. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 6 of 11
16. (take_image satellite0 star11 instrument0 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 7 of 11
17. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 7 of 11
18. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 8 of 11
19. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 11
20. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 9 of 11
21. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 10 of 11
22. (take_image satellite0 star12 instrument0 image2)
   added: (have_image star12 image2)
   goals met: 11 of 11
